In [132]:
import numpy as np
import pandas as pd

%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [133]:
d = pd.read_csv("data.csv", encoding='latin1')
d.head()

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

In [134]:
d.isna().sum()

job_title          0
hh_title           0
age               50
salary           706
exp. period        0
title of exp.      0
dtype: int64

In [135]:
d.dropna(inplace=True)
d

,job_title,hh_title,age,salary,exp. period,title of exp.
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst
11,data analyst,Data Analyst,25.0,860000.0,2.92,Âåäóùèé ñïåöèàëèñò ÑÂÌ Äåïàðòàìåíòà ïëàíèðîâàí...
12,data analyst,Software Developer,28.0,950000.0,7.25,Data Analyst
15,data analyst,Data analyst,29.0,500000.0,6.75,Âåäóùèé èíæåíåð ïðîåêòà
21,data analyst,Data analyst,22.0,500000.0,3.33,Interpreter
...,...,...,...,...,...,...
989,sql,ïðîãðàììèñò Oracle,56.0,860.0,15.25,Ãëàâíûé ñïåöèàëèñò îòäåëà èíôîðìàöèîííûõ òåõíî...
990,sql,Ðóêîâîäèòåëü îòäåëà IT,32.0,645000.0,10.67,Òåõíè÷åñêèé äèðåêòîð
991,sql,Junior PL/SQL Developer Òåñòèðîâùèê,28.0,200000.0,6.58,Íàñòàâíèê
992,sql,Ïðîãðàììèñò-ðàçðàáîò÷èê,38.0,500000.0,11.42,Delphi/MSSQL developer
994,sql,Senior Backend Developer,29.0,1505000.0,0.58,Full Stack Developer

In [136]:
x = d.drop(['job_title', 'hh_title', 'title of exp.'], axis = 1)
x

      age     salary  exp. period
4    27.0   450000.0         3.25
11   25.0   860000.0         2.92
12   28.0   950000.0         7.25
15   29.0   500000.0         6.75
21   22.0   500000.0         3.33
..    ...        ...          ...
989  56.0      860.0        15.25
990  32.0   645000.0        10.67
991  28.0   200000.0         6.58
992  38.0   500000.0        11.42
994  29.0  1505000.0         0.58

[274 rows x 3 columns]

In [137]:
y = d['job_title']
y

4      data analyst
11     data analyst
12     data analyst
15     data analyst
21     data analyst
           ...
989             sql
990             sql
991             sql
992             sql
994             sql
Name: job_title, Length: 274, dtype: object

In [138]:
from sklearn.model_selection import train_test_split

In [139]:
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size = 0.8, stratify = y)

In [140]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [141]:
model.fit(x, y)
y_model = model.predict(x)

In [142]:
from sklearn.metrics import accuracy_score
accuracy_score(y, y_model)

0.4708029197080292

In [143]:
from sklearn.model_selection import cross_val_score

In [144]:
score = cross_val_score(model, x,y, cv=10)
score

array([0.5       , 0.46428571, 0.46428571, 0.5       , 0.44444444,
       0.48148148, 0.44444444, 0.48148148, 0.44444444, 0.48148148])

In [145]:
score.mean()

0.47063492063492063

In [146]:
from sklearn.neighbors import KNeighborsClassifier
model = KNeighborsClassifier (n_neighbors = 3)

In [147]:
x1, x2, y1, y2 = train_test_split(x,y, random_state = 0, train_size = 0.8)

In [149]:
model.fit(x1,y1)

KNeighborsClassifier(n_neighbors=3)

In [151]:
y2model = model.predict(x2)
accuracy_score(y2, y2model)

0.9454545454545454

In [152]:
score2 = cross_val_score(model,x,y, cv=10)
score2

array([1.        , 0.92857143, 0.96428571, 0.89285714, 0.96296296,
       0.92592593, 1.        , 0.88888889, 0.96296296, 0.88888889])

In [153]:
score2.mean()

0.9415343915343917